app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 0]]
UPDATE "movies" SET "rating" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["rating", "R"], ["updated_at", "2015-10-06 19:21:56.871995"], ["id", 1]]
---
  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(movie_params)

INSERT INTO "movies" ("rating", "created_at", "updated_at") VALUES (?, ?, ?)  [["rating", "#<Enumerator:0x00000007dfcd28>"], ["created_at", "2015-10-18 22:26:24.636965"], ["updated_at", "2015-10-18 22:26:24.636965"]]
---
  def add_tmdb
    movie_ids = params[:tmdb_movies]
    if movie_ids == nil
      flash[:notice] = "No movies were added"
    else
      movie_ids = movie_ids.keys
      movie_ids.each {|id| Movie.create_from_tmdb(id)}